In [1]:
import pandas as pd
import numpy as np

## NaN´s

In [4]:
data = {
    'Nome':['Teo', 'Maria', 'Lara', 'Nath', 'Ste'],
    'Idade':[32,22,56,21,np.nan],
    'Renda':[np.nan, 3456, 2500, 5500, np.nan]
}

df = pd.DataFrame(data)

In [5]:
df

    Nome  Idade   Renda
0    Teo   32.0     NaN
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0
4    Ste    NaN     NaN

In [6]:
df['Renda'].isna()

0     True
1    False
2    False
3    False
4     True
Name: Renda, dtype: bool

In [7]:
df['Renda'].isna().sum()

np.int64(2)

In [9]:
df.isna().sum()

Nome     0
Idade    1
Renda    2
dtype: int64

In [ ]:
df.isna().mean() #proporção de NAN por coluna

Nome     0.0
Idade    0.2
Renda    0.4
dtype: float64

In [12]:
df.fillna({"Idade": df['Idade'].mean(),
           "Renda":df['Renda'].mean()})

    Nome  Idade        Renda
0    Teo  32.00  3818.666667
1  Maria  22.00  3456.000000
2   Lara  56.00  2500.000000
3   Nath  21.00  5500.000000
4    Ste  32.75  3818.666667

In [13]:
df.dropna()

    Nome  Idade   Renda
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [15]:
df.dropna(subset=['Idade','Renda'], how="all")

    Nome  Idade   Renda
0    Teo   32.0     NaN
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [16]:
df.dropna(subset=['Idade','Renda'], how="any")

    Nome  Idade   Renda
1  Maria   22.0  3456.0
2   Lara   56.0  2500.0
3   Nath   21.0  5500.0

In [17]:
df.dropna(axis=1)

    Nome
0    Teo
1  Maria
2   Lara
3   Nath
4    Ste

## Groupby

In [18]:
PATH = r"C:\Users\steph\OneDrive\Documentos\MeusProjetos\Estudos\pandas\data\transactions.xlsx"

df = pd.read_excel(PATH)
df

,UUID,IdCustomer,DtTransaction,Points
0,fb4e3102-6125-414e-b086-e7f641e38f93,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 11:53:23.774,1
1,036b8d66-8adf-479b-ba0f-cb0e3207acb0,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 11:53:24.643,1
2,10166182-a164-4608-8cdf-35e4450b2bd7,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:11:44.728,500
3,03974c58-e86e-4b6b-8143-8f89ca870d09,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:19:41.063,1
4,e84703a6-b606-4096-a2f3-514971c16c5c,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:31:46.288,500
...,...,...,...,...
23497,25500149-c2b8-4942-90f7-39f136d9fb1b,2d7f6b3f-9366-44c1-9663-beb5f7e1254e,2024-03-04 12:24:18.083,1
23498,75b3856f-083d-4775-98c9-7a9791b4d693,0ed6b09e-4329-4d2a-837b-2aad4796cd3a,2024-03-04 12:24:27.976,1
23499,827a1417-902c-4657-a0e5-4cef5d2bd8ca,0ed6b09e-4329-4d2a-837b-2aad4796cd3a,2024-03-04 12:25:13.024,1
23500,7429b0a5-08a5-470c-8091-12f627d21911,f3a268f2-1788-47da-bc79-2680a1721254,2024-03-04 12:25:28.565,50
23501,07d25502-18a9-4107-b4af-9b5ba8b5a46d,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:26:03.369,1

In [19]:
df_user = df[df['IdCustomer'] == '5f8fcbe0-6014-43f8-8b83-38cf2f4887b3']
df_user

,UUID,IdCustomer,DtTransaction,Points
0,fb4e3102-6125-414e-b086-e7f641e38f93,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 11:53:23.774,1
1,036b8d66-8adf-479b-ba0f-cb0e3207acb0,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 11:53:24.643,1
2,10166182-a164-4608-8cdf-35e4450b2bd7,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:11:44.728,500
3,03974c58-e86e-4b6b-8143-8f89ca870d09,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:19:41.063,1
4,e84703a6-b606-4096-a2f3-514971c16c5c,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-01-27 12:31:46.288,500
...,...,...,...,...
23468,ece6108f-d023-4b93-8527-cbba91ab9d61,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:17:11.255,1
23469,f48babe7-5fe4-4e74-bc80-c98f4b375df7,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:17:11.640,1
23486,5307a47e-fcfa-45db-ac90-f753189845f1,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:19:57.120,1
23496,e8b6d4a6-6aa3-40cf-ab41-d1937b542d96,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:24:16.434,1
23501,07d25502-18a9-4107-b4af-9b5ba8b5a46d,5f8fcbe0-6014-43f8-8b83-38cf2f4887b3,2024-03-04 12:26:03.369,1

In [20]:
df_user['Points'].sum()

np.int64(4405)

In [23]:
df.groupby(['IdCustomer'])['Points'].mean()

IdCustomer
000ff655-fa9f-4baa-a108-47f581ec52a1    17.333333
0097ab76-4637-4ece-8ebc-ab6abd61d662    30.400000
012bc897-e45c-4e6a-a742-7e00fa2e59e5    25.500000
014491f5-caa3-4122-be69-a31411ad4bd7    13.250000
014b7774-561a-4a58-93d7-070667df90fb     4.500000
                                          ...
fbd9b6fd-0b1a-436c-822e-7c4dd4fe0c70    50.000000
fcbb3e3a-e147-4a13-9f24-80e33f3ae194     6.444444
fe348fe6-a2f7-4f3f-b932-c10ad0b5692e    50.000000
fe59fd95-d131-4d50-bb6e-10cdfa7d5f47     3.951807
fecbdf63-3bf4-44e5-8b1a-0acc9d963603     8.538462
Name: Points, Length: 727, dtype: float64

In [25]:
df_sumary = df.groupby(['IdCustomer'])['Points'].sum()
df_sumary.reset_index()

                               IdCustomer  Points
0    000ff655-fa9f-4baa-a108-47f581ec52a1      52
1    0097ab76-4637-4ece-8ebc-ab6abd61d662     152
2    012bc897-e45c-4e6a-a742-7e00fa2e59e5      51
3    014491f5-caa3-4122-be69-a31411ad4bd7      53
4    014b7774-561a-4a58-93d7-070667df90fb     126
..                                    ...     ...
722  fbd9b6fd-0b1a-436c-822e-7c4dd4fe0c70      50
723  fcbb3e3a-e147-4a13-9f24-80e33f3ae194      58
724  fe348fe6-a2f7-4f3f-b932-c10ad0b5692e      50
725  fe59fd95-d131-4d50-bb6e-10cdfa7d5f47     328
726  fecbdf63-3bf4-44e5-8b1a-0acc9d963603     111

[727 rows x 2 columns]

In [ ]:
df.groupby(["IdCustomer"]).agg(
    {
     "Points": "sum",
     "UUID": "count", 
     "DtTransaction":"max"
    }
).reset_index()

,IdCustomer,Points,UUID,DtTransaction
0,000ff655-fa9f-4baa-a108-47f581ec52a1,52,3,2024-03-04 12:00:53.979
1,0097ab76-4637-4ece-8ebc-ab6abd61d662,152,5,2024-02-08 13:56:46.749
2,012bc897-e45c-4e6a-a742-7e00fa2e59e5,51,2,2024-02-05 12:24:09.715
3,014491f5-caa3-4122-be69-a31411ad4bd7,53,4,2024-02-29 22:28:54.356
4,014b7774-561a-4a58-93d7-070667df90fb,126,28,2024-02-06 13:22:58.636
...,...,...,...,...
722,fbd9b6fd-0b1a-436c-822e-7c4dd4fe0c70,50,1,2024-02-05 13:58:26.275
723,fcbb3e3a-e147-4a13-9f24-80e33f3ae194,58,9,2024-02-06 14:05:39.814
724,fe348fe6-a2f7-4f3f-b932-c10ad0b5692e,50,1,2024-02-23 11:58:58.401
725,fe59fd95-d131-4d50-bb6e-10cdfa7d5f47,328,83,2024-03-01 12:03:12.124
726,fecbdf63-3bf4-44e5-8b1a-0acc9d963603,111,13,2024-02-06 12:14:33.614

In [28]:
df.groupby(["IdCustomer"]).agg(
    {
     "Points": "sum",
     "UUID": "count", 
     "DtTransaction":"max"
    }
).reset_index().rename(
    columns={
     "Points": "Valor",
     "UUID": "Frequência", 
     "DtTransaction":"Última data"
    }
)

,IdCustomer,Valor,Frequência,Última data
0,000ff655-fa9f-4baa-a108-47f581ec52a1,52,3,2024-03-04 12:00:53.979
1,0097ab76-4637-4ece-8ebc-ab6abd61d662,152,5,2024-02-08 13:56:46.749
2,012bc897-e45c-4e6a-a742-7e00fa2e59e5,51,2,2024-02-05 12:24:09.715
3,014491f5-caa3-4122-be69-a31411ad4bd7,53,4,2024-02-29 22:28:54.356
4,014b7774-561a-4a58-93d7-070667df90fb,126,28,2024-02-06 13:22:58.636
...,...,...,...,...
722,fbd9b6fd-0b1a-436c-822e-7c4dd4fe0c70,50,1,2024-02-05 13:58:26.275
723,fcbb3e3a-e147-4a13-9f24-80e33f3ae194,58,9,2024-02-06 14:05:39.814
724,fe348fe6-a2f7-4f3f-b932-c10ad0b5692e,50,1,2024-02-23 11:58:58.401
725,fe59fd95-d131-4d50-bb6e-10cdfa7d5f47,328,83,2024-03-01 12:03:12.124
726,fecbdf63-3bf4-44e5-8b1a-0acc9d963603,111,13,2024-02-06 12:14:33.614

In [29]:
from datetime import datetime

data1 = df['DtTransaction'][0]
now = datetime.now()

(now - data1).days

528

In [33]:
condicao = df['IdCustomer'] == "5f8fcbe0-6014-43f8-8b83-38cf2f4887b3"
df_user = df[condicao]
diff = datetime.now() - df_user['DtTransaction'].max()
diff.days

491

In [34]:
def recencia(x):
    diff = datetime.now() - x.max()
    return diff.days

In [36]:
df.groupby(["IdCustomer"]).agg(
    {
     "Points": "sum",
     "UUID": "count", 
     "DtTransaction":recencia
    }
).reset_index().rename(
    columns={
     "Points": "Valor",
     "UUID": "Frequência", 
     "DtTransaction":"Recência"
    }
)

                               IdCustomer  Valor  Frequência  Recência
0    000ff655-fa9f-4baa-a108-47f581ec52a1     52           3       491
1    0097ab76-4637-4ece-8ebc-ab6abd61d662    152           5       516
2    012bc897-e45c-4e6a-a742-7e00fa2e59e5     51           2       519
3    014491f5-caa3-4122-be69-a31411ad4bd7     53           4       495
4    014b7774-561a-4a58-93d7-070667df90fb    126          28       518
..                                    ...    ...         ...       ...
722  fbd9b6fd-0b1a-436c-822e-7c4dd4fe0c70     50           1       519
723  fcbb3e3a-e147-4a13-9f24-80e33f3ae194     58           9       518
724  fe348fe6-a2f7-4f3f-b932-c10ad0b5692e     50           1       501
725  fe59fd95-d131-4d50-bb6e-10cdfa7d5f47    328          83       494
726  fecbdf63-3bf4-44e5-8b1a-0acc9d963603    111          13       518

[727 rows x 4 columns]

## Cruzamento de dados

In [2]:
data_user = {
    "Id":[1,2,3,4,5],
    'Nome':['Teo', 'Maria', 'Lara', 'Nath', 'Ste'],
    'Idade':[32,22,56,21,21],
}

df_user = pd.DataFrame(data_user)

In [3]:
data_transacoes = {
    "Id_user":[1,1,1,2,3,3],
    'Valor':[432,532,123,6,4,87],
    'QdtProdutos':[2,1,3,6,10,2],
}

df_transacoes = pd.DataFrame(data_transacoes)

In [4]:
df_user

   Id   Nome  Idade
0   1    Teo     32
1   2  Maria     22
2   3   Lara     56
3   4   Nath     21
4   5    Ste     21

In [5]:
df_transacoes

   Id_user  Valor  QdtProdutos
0        1    432            2
1        1    532            1
2        1    123            3
3        2      6            6
4        3      4           10
5        3     87            2

In [6]:
df_transacoes.merge(
    df_user, 
    how="left", 
    left_on="Id_user", 
    right_on="Id"    
)

   Id_user  Valor  QdtProdutos  Id   Nome  Idade
0        1    432            2   1    Teo     32
1        1    532            1   1    Teo     32
2        1    123            3   1    Teo     32
3        2      6            6   2  Maria     22
4        3      4           10   3   Lara     56
5        3     87            2   3   Lara     56

In [7]:
df_transacoes.merge(
    df_user, 
    how="inner", 
    left_on="Id_user", 
    right_on="Id"    
)

   Id_user  Valor  QdtProdutos  Id   Nome  Idade
0        1    432            2   1    Teo     32
1        1    532            1   1    Teo     32
2        1    123            3   1    Teo     32
3        2      6            6   2  Maria     22
4        3      4           10   3   Lara     56
5        3     87            2   3   Lara     56